{
    "head": {
        "title": "ﾘｱﾑ･ｱｰﾐﾃｰｼﾞ - ﾃｸﾆｶﾙｱｰﾃｨｽﾄ"
    },
    "header": {
        "title": "リアム・アーミテージ",
        "subTitle": "テクニカルアーティスト",
        "resume": "&nbsp; 履歴書",
        "back": "ポートフォリオへ",
        "about": "私について",
        "translate": "あ → Ａ"
    },
    "main": {
        "introduction": {
            "title": "Comdex Heist - アセットパイプライン全体を挑戦！",
            "description": "Comdex Heistは、古代の考え方と未来的なファンタジーが融合するディストピアなサイバーパンクの未来を舞台にした、大規模な進行中のアニメーション短編プロジェクトです。物語は、強大な企業に対する強盗後に逃走する錬金術師、アルカリの旅を描いています。彼の後を追うのは、恐ろしい装甲形態と分解ナノボットの制御能力を持つ、無慈悲で地位の高い企業員、シブです。このプロジェクトは、追跡シーンのスリルと、鋼の錬金術師やジョジョの奇妙な冒険などのアニメからの強いインスピレーションを受けたクリエイティブなガジェットと能力の使用を融合しています。",
            "link": "このプロジェクトの進行状況については、私のNotionページを<a href='https://snowy-engine-238.notion.site/Comdex-Heist-53450a756f984286b9ec9e4bdfb3829a'>こちら</a>でご覧いただけます！"
        },
        "role": {
            "title": "役割",
            "description1": "唯一のクリエイターとして、私は<b>イラストレーター</b>と<b>3Dアーティスト</b>の役割を担い、コンセプトスケッチや衣装デザインからキャラクターの彫刻やリギングまで、様々なタスクを担当しています。目標は、複雑で魔法のようなセッティングを生き生きと描き出すことで、よく仲間と協議して、描きたい物語を効果的に表現するデザインを確認しています。（かっこよさを保ちながら！）"
        },
        "process": {
            "title": "プロセスとツール",
            "description1": "プロセスは、初期のキャラクターの彫刻から始めてZ-Brushを使用し、その後Blenderに切り替えてリトポロジーとリギングを行います。テクスチャリングには、Substance Painterが大変便利でした！"
        },
        "visualization": {
            "title": "メディア",
            "caption1": "アルカリの紙に描いたコンセプトスケッチ",
            "caption2": "シブの紙に描いたコンセプトスケッチ",
            "caption3": "アルカリの前面と側面のラインスケッチ",
            "caption4": "シブの前面と側面のラインスケッチ",
            "caption5": "アルカリの着色された衣装の参照",
            "caption6": "シブの着色された衣装の参照、装甲とドレスの両方で",
            "caption7": "アルカリのモデルのUV展開の詳細",
            "caption8": "ムードボードのコレクション",
            "caption9": "アルカリのZ-Brushスカルプト",
            "caption10": "シブのZ-Brushスカルプト",
            "caption11": "アルカリのリトポロジー化されたモデル",
            "caption12": "シブのリトポロジー化されたモデル"
        },
        "challenges": {
            "title": "課題と学び",
            "description1": "特定のツールへの金銭的な障壁は初期の課題でしたが、プロジェクトのスコープと期待を管理することがより広い課題でした。高品質のアニメーション短編を作成することは激務ですが、それに取り組むことは私にとって興奮することです。私は、野心と実際の制約をバランスさせることを学び、他のテックアートプロジェクトと並行してこの作業を行ってきました。このような創造的自由を行使し、仲間から肯定的なフィードバックを得る機会は、信じられないほどの報酬でした。"
        },
        "futureplans": {
            "title": "将来の計画",
            "description1": "現在は、技術芸術に焦点を当てたさまざまなプロジェクトに取り組むことでスキルセットを深化させることに専念していますが、Comdex Heistは私が取り組む長期的な目標のままです。定したフローチャートに従い、時間が許す限りプロジェクトに時間を割くつもりです。"
        },
        "meme": {
            "caption": "プロジェクトが進行中である間、私が作ったこの面白いミームを楽しんでください！曲：ｳｯｰｳｯｰｳﾏｳﾏ(ﾟ∀ﾟ)"
        }
    }
}