{
    "head": {
        "title": "ﾘｱﾑ･ｱｰﾐﾃｰｼﾞ - ﾃｸﾆｶﾙｱｰﾃｨｽﾄ"
    },
    "header": {
        "title": "リアム・アーミテージ",
        "subTitle": "テクニカルアーティスト",
        "resume": "&nbsp; 経歴書",
        "back": "戻る",
        "about": "私について",
        "translate": "あ → Ａ"
    },
    "main": {
      "introduction": {
        "title": "うごくメモ帳風シェーダーの開発",
        "description": "このプロジェクトでは、任天堂DSiと3DSのうごくメモ帳の視覚的スタイルを取り入れ、その独特の美学をリアルタイムの3D環境に翻訳しました。このチャレンジは、Unity内のHLSLシェーダープログラミングを通じて攻略されました。",
        "link": "私のプロセスの詳細を是非、こちらの<a href='https://snowy-engine-238.notion.site/100-Days-of-Tech-Art-94e362b1607e45029b795429b6d6c4f6'>ジャーナル</a>をご覧ください！"
      },
      "approach": {
        "title": "デザインへのアプローチ",
        "description": "シェーダーデザインのプロセスは以下の技術を通じて素晴らしい洞察を提供しました：",
        "method1": "<b>スクリーンスペースディザリング</b>：Pythonを使用して、3DSカラーパレットから視覚的に最も近い色相を見つけ、その「ディザパレット」の8x8の正方形の左上隅を指す立体マッピングテクスチャを生成しました。その後、シェーダー内でピクセル座標が使用されて、8x8セル内の位置を決定し、スクリーンスペースディザリング効果を生み出します。",
        "method2": "<b>深度ノーマル</b>：シーンのノーマルマップと深度マップの二つのマップの組み合わせを使用しました。これらはカメラに近いオブジェクトのアウトラインを信頼性のある方法で作成するために掛け合わせられました。",
        "method3": "<b>エッジ検出</b>：ここでは、ソーベルフィルタを適用しました。これは、カーネルを画像のx座標とy座標に畳み込むというものです。この場合、深度ノーマルに適用されました。",
        "method4": "<b>ノイズを帯びたアウトライン</b>：擬似乱数ジェネレータを適用して、アウトラインに「スケッチ風」の感じを加え、うごくメモ帳のカジュアルで低解像度な雰囲気を思い出させます。",
        "description2": "Unityの組み込み関数とのインターフェイス作業や密度の高いドキュメンテーションを解析する上での課題にもかかわらず、仲間の助けと十分なリサーチを通じて、基本レベルでのシェーダープログラミングについて多くを学び、乗り越えることができました！"
      },
      "visualization": {
        "title": "ビジュアライゼーションとプレビュー",
        "caption1": "3DSのカラーパレットを使用した異なる色距離モデルのディザ表現。",
        "caption2": "3DSのカラーパレットの立体マッピングテクスチャのビジュアライゼーション。",
        "caption3": "ノイズによって作られたエッジの分散、シェーダーの楽しいスケッチ感を増加させます！"
      },
      "conclusion": {
        "title1": "最適化と今後の計画",
        "description1": "システムに大幅にパフォーマンスを向上させる可能性のある改善を特定しました。例えば、ディザパレットを各フラグメントでサンプルされる立体テクスチャと結合することで、サンプルコールの数を減らすことができます。これはパフォーマンス向上の重要なエリアです。また、ノイズ関数のために、より計算量が少ない数学計算を探求する計画もあります。",
        "title2": "応用と統合",
        "description2": "シェーダーはユーザーフレンドリーなUnityパッケージファイルとしてパッケージ化され、任意のカメラに対するポストプロセッシングエフェクトとして簡単に実装することができます。ここからダウンロードできます！",
        "title3": "インスピレーションと学習",
        "description3": "このプロジェクトは、計り知れない学習の旅でした。様々なすごくクールなオンラインの人々、例えば<a href='https://www.youtube.com/@Acerola_t' class='inspirations' target='_blank'>Acerola</a>、<a href='https://www.youtube.com/@Acegikmo' class='inspirations' target='_blank'>Freya Holmér</a>、そして<a href='https://www.ronja-tutorials.com/' class='inspirations' target='_blank'>Ronja</a>などは、このようなものへの素晴らしい導入でした。技術的な探索とノスタルジックな美学を組み合わせたこのプロジェクトは、私にとって非常に魅力的でした。これはスリリングなプロセスであり、将来、シェーダープログラミングで可能なことの境界を押し広げることを楽しみにしています！"
      }
    }
  }
