{
    "head": {
      "title": "ﾘｱﾑ･ｱｰﾐﾃｰｼﾞ - ﾃｸﾆｶﾙｱｰﾃｨｽﾄ"
    },
    "header": {
      "title": "リアム・アーミテージ",
      "subTitle": "テクニカルアーティスト",
      "resume": "&nbsp; 履歴書",
      "back": "ポートフォリオへ",
      "about": "私について",
      "translate": "あ → Ａ"
    },
    "main": {
      "introduction": {
        "title": "徐倫の糸 - プロシージャルアセット生成",
        "description": "このプロジェクトはジョジョの奇妙な冒険：ストーンオーシャンの空条徐倫に触発され、アーティストとアニメーターがブレンダーで糸を動的に作成し、操作するシステムを作り出すことを目指しています。このプロジェクトはプロシージャルアセット生成に深く潜り込み、エンドユーザーとアーティストの創造的ニーズを満たすツールの開発方法を学びました。",
        "link": "私のプロセスについて詳しく知りたい方は、<a href='https://snowy-engine-238.notion.site/100-Days-of-Tech-Art-94e362b1607e45029b795429b6d6c4f6'>こちら</a>のプロジェクトジャーナルをご覧ください！"
      },
      "approach": {
        "title": "技術的実装",
        "description": "このプロジェクトは、ユニークな手法のブレンドを通じて実装されました：",
        "method1": "<b>ベジエ曲線とジオメトリノード：</b>ブレンダーのジオメトリノードを用いて、糸のパスとプロシージャルテキストの生成と操作を可能にするシステムを作成しました。",
        "method2": "<b>動的メッシュ作成：</b>糸はリアルタイムでスプラインの変化に適応する動的メッシュとして表現されています。",
        "method3": "<b>インタラクティビティとコントロール：</b>ブレンダーのノードエディタ内で編集可能な変数の幅広い配列を実装しました。これにより、アーティストは半径やグラフィッククオリティなどを簡単に変更することができます。また、位置、間隔、回転、スケーリング、アニメーションノイズ値などのテキスト設定も変更可能です。",
        "description2": "糸のアセットはリアルタイムで変化に対応し、視覚的に一貫性があり、何よりもアーティストが直感的に使用できる必要がありました。これらの基準を満たすツールを確保するためには、複雑な問題をその成分部分に分解し、ベクトル数学に取り組み、ブレンダーのツールセットを習得することが必要でした。"
      },
      "visualization": {
        "title": "視覚化",
        "caption1": "エンドキャップは、スレッドの残りの部分の回転と向きに従う。",
        "caption2": "アーティストがコントロールできるパラメーターだけで、テキストで何ができるかを示すデモ。",
        "caption3": "カラーランプをスクラブするによる糸のテクスチャへの影響。"
      },
      "conclusion": {
        "title1": "今後の計画",
        "description1": "将来的には、糸のメッシュにもう1つ抽象的なレイヤーを追加して、糸自体をカーブに沿わせることで、アーティストにとってより直感的なものにしようと考えています。さらなる改善点としては、視覚的に魅力的な糸のためにテクスチャマッピングアルゴリズムを改善することが挙げられます。",
        "description2": "現時点での最大の問題は、アニメーションの期間中、コントロールポイントの数が一定でなければならず、エディタで作成された新しい点はすべて最後に追加されなければならないことです。これは将来的には、おそらくカスタム製の別の種類のカーブを使用して解決できると思います。",
        "title2": "アセットのダウンロード",
        "description3": "自分のプロジェクトでアセットを使ってみたい場合は、こちらからダウンロードしてください！",
        "title3": "今後について",
        "description4": "このプロジェクトはプロシージャルアセット生成へのユニークな旅で、アーティストフレンドリーなツールの開発に私を挑戦させました。アセット生成とツール作成の領域でさらに探求することを楽しみにしています。"
      }
    }
  }
  