{
    "head": {
      "title": "Liam Armitage - Technical Artist"
    },
    "header": {
      "title": "Liam Armitage",
      "subTitle": "Technical Artist",
      "resume": "&nbsp; Resume",
      "back": "To Portfolio",
      "about": "About Me",
      "translate": "Ａ → あ"
    },
    "main": {
      "introduction": {
        "title": "Sword of the Morel - A Game/Music Jam 2022 Project",
        "description": "Sword of the Morel is a charming 2D platformer based on the theme of growth. The player stars as a mushroom boy, Mica, who embarks on a quest to reclaim his village, using a sword that grows stronger with each defeated enemy. This project won the \"Best Visuals\" award at the Game/Music Jam 2022.",
        "link": "Feel free to play the game at <a href='https://fumpledump.itch.io/sword-of-the-morel' target='_blank'>Sword of the Morel on Itch.io</a>"
      },
      "role": {
        "title": "Role and Contribution",
        "description1": "As a <b>Background and Asset Artist</b>, I had the opportunity to create numerous large-scale pixel art sprites, contributing significantly to the game's aesthetic and gameplay experience. Accumulating over 60 hours in Aseprite, I was able to enhance the game's visuals and master the use of this pixel art tool."
      },
      "assets": {
        "title": "Creation of Assets",
        "description1": "The visual style of the game was largely dictated by the pixel style and color palette I used. By referencing various types of mushrooms and incorporating a nature-themed aesthetic, I created assets that enhanced the game's charm and atmosphere."
      },
      "trailer": {
        "caption": "A game trailer produced by <a href='https://johndevelopment.com/'>John Haley</a>"
      },
      "visualization": {
        "title": "Samples"
      },
      "challenges": {
        "title": "Challenges and Solutions",
        "description1": "The time constraint of the competition and the resolution differences between the level design and my sprites posed significant challenges. Despite these, we communicated as best as we could and found ways to integrate the assets effectively, contributing to a cohesive and visually engaging game."
      },
      "awards": {
        "title": "Awards and Recognition",
        "description1": "Our game not only won the '<b>Best Visuals</b>' and '<b>Best Soundtrack</b>' awards at the Game/Music Jam 2022, but also received high praise at the 2023 RIT Student Game Showcase and Expo. Players and reviewers enjoyed the novel mechanics and distinctive visual style of the game."
      },
      "future": {
        "title": "Future Plans",
        "description1": "Although current plans are nebulous, the team has expressed interest in further developing the game. We look forward to the potential opportunity to expand upon our initial concept and continue our journey with Sword of the Morel."
      }
    }
  }
  